demo/constant/fiberProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "constant";
 local "";
 class dictionary;
 object fiberProperties;
}

FiberSuspension yes;
CorrectA2 yes;
FiberClosure quadratic; 	//hybrid;//IBOF; //quadratic;

Ns 0.0;

Np 0.0;

Ci 0.01;

U0 0.0;

FiberLength 0.0003;

FiberDiameter 1e-05;

VolumeFraction 10;

Kappa 1.0;

FiberConcentration no;


