demo/constant/injectionPoints
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object injectionPoints;
}

point0 
{
	type circle;
	center (0.00820030124597 0.5 0.0108579340742);
	radius 0.5;
	axis (-0.0 -1.0 -0.0);
	height 0.001;
	flowRate 0.25;
	T 400.0;
	profileExp 2.0;
	profileExpA2 0.0;
};

point1 
{
	type circle;
	center (0.0 0.0 1.5);
	radius 0.25;
	axis (-0.0 -0.0 -1.0);
	height 0.001;
	flowRate 0.25;
	T 500.0;
	profileExp 2.0;
	profileExpA2 0.0;
};

