demo/constant/solverProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "constant";
 local "";
 class dictionary;
 object solverProperties;
}

fillPercentWritePoints ();

fillPercentBreak 100.0;

fillPercentTol 0.0001;

fillPercentWriteInterval 5;

fillSingularityBreak 0.95;

fillPercentOvershootBreak 10000.0;

UEqnForm standard;

UEqnStabParam 0;

UEqnNpCoupling 1.0;

UEqnNpStabParam1 0.3;

UEqnNpStabParam2 3.0;

alphaCutoffU 0.002;

viscosityModel constant;

viscosityA0 0.1;

viscosityA1 0.65;

viscosityA2 0.021;

viscosityTref 230.0;

wallTref 200.0;

heatConductivity1 0.16;

heatConductivity2 0.024;

specificHeat1 1900;

specificHeat2 1000; 	/*
compressible 0;

nCorrectors 0;

fiberAlphaBlend 0;

fiberStabScale 1.5;

coolTemperatureBreak 400;

deltaTcool 2.0; 	// timestep during cooling

decompress off;

stabUEqn off;

tFadeInFiberStress 0.02;

relaxVelocity 0.0;

relaxFiberStress 0.0;

alphaFiberExp 1000.0;

alphaWallExp 5.0;

sourceA2Exp 1;

harmonicMu off;

initAlpha off;


ficticiousDom off;

useFluxBcU on;

useFluxBcP on;


implicitAlpha off;

fillAlphaBoundaryContact 0.8;

fillAlphaBoundary 0.5;

useDevClosure on;



*/

