demo/constant/thermophysicalProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object thermophysicalProperties;
}

phases
  (
    "1"
    "2"
  );

pMin pMin     [ 1 -1 -2 0 0 0 0 ]     10000 ;

sigma sigma     [ 1 0 -2 0 0 0 0 ]     0.072 ; 	// ************************************************************************* //

