demo/constant/transportProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object transportProperties;
}

phases
  (
    "phase1"
    "phase2"
  );

"phase1"
{
  transportModel Newtonian;
  nu nu       [ 0 2 -1 0 0 0 0 ]       0.1 ;
  rho 1000;
  CrossPowerLawCoeffs
  {
    nu0 nu0         [ 0 2 -1 0 0 0 0 ]         1e-06 ;
    nuInf nuInf         [ 0 2 -1 0 0 0 0 ]         1e-06 ;
    m m         [ 0 0 1 0 0 0 0 ]         1 ;
    n n         [ 0 0 0 0 0 0 0 ]         0 ;
  }
  BirdCarreauCoeffs
  {
    nu0 nu0         [ 0 2 -1 0 0 0 0 ]         0.0142515 ;
    nuInf nuInf         [ 0 2 -1 0 0 0 0 ]         1e-06 ;
    k k         [ 0 0 1 0 0 0 0 ]         99.6 ;
    n n         [ 0 0 0 0 0 0 0 ]         0.1003 ;
  }
}

"phase2"
{
  transportModel Newtonian;
  nu nu       [ 0 2 -1 0 0 0 0 ]       0.01 ; 	//1.48e-05
  rho 1;
  CrossPowerLawCoeffs
  {
    nu0 nu0         [ 0 2 -1 0 0 0 0 ]         1e-06 ;
    nuInf nuInf         [ 0 2 -1 0 0 0 0 ]         1e-06 ;
    m m         [ 0 0 1 0 0 0 0 ]         1 ;
    n n         [ 0 0 0 0 0 0 0 ]         0 ;
  }
  BirdCarreauCoeffs
  {
    nu0 nu0         [ 0 2 -1 0 0 0 0 ]         0.0142515 ;
    nuInf nuInf         [ 0 2 -1 0 0 0 0 ]         1e-06 ;
    k k         [ 0 0 1 0 0 0 0 ]         99.6 ;
    n n         [ 0 0 0 0 0 0 0 ]         0.1003 ;
  }
}

sigma sigma     [ 1 0 -2 0 0 0 0 ]     0.072 ; 	// ************************************************************************* //

