demo/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application injectionMoldingFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 10000000000.0;

deltaT 0.0001;

writeControl timeStep;

writeInterval 100000000;

purgeWrite 0;

writeFormat ascii;

writePrecision 8;

writeCompression compressed;

timeFormat general;

timePrecision 10;

runTimeModifiable yes;
adjustTimeStep yes;
maxCo 0.5;

maxDeltaT 1;

maxAlphaCo 1;

functions
  (
  ); 	/*
    pAverage
    {
        functionObjectLibs ("libutilityFunctionObjects.so");
        type coded;
        redirectType average;
        outputControl outputTime;
        code
        #{
            const volScalarField& p =
                mesh().lookupObject<volScalarField>("p");
            Info<<"p avg:" << average(p) << endl;
        #};
    }
*/// ************************************************************************* //

