demo/system/decomposeParDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object decomposeParDict;
}

numberOfSubdomains 1;

method scotch;

simpleCoeffs
{
  n (1 4 1);
  delta 0.001;
}

hierarchicalCoeffs
{
  n (1 4 1);
  delta 0.001;
  order xyz;
}

manualCoeffs
{
  dataFile "";
}

distributed no;
roots
  (
  ); 	// ************************************************************************* //

